An air traffic controller can use his computer through voice commands. Convert this text to a programmatic command. A command can take some optional parameters.

The commands are:

 - show-flight: Move the map to a specific flight, the current one the one identified by the optional call sign argument.
 - acknwoledge-flight: Acknowledge the controller responsability on a flight, the current one or the optional call sign argument.
 - speed-vectors: Set speed vector size from 0 to 15 minutes, showing where the flights are going to be in the future based on their current speed and bearing.
 - flight-labels: Toggle (on/off) the flight labels, containing information about the planes on the map radar view.
 - invalid-command: The default command when it is invalid.

Example: Show me the speed vectors.
Output: speed-vectors 5

Example: speed vectors to 12.
Output: speed-vectors 12

Example: Hide the flight labels.
Output: flight-labels off

Example: Where is the flight SAS283 ?
Output: show-flight SAS283